app/Services/QueryDetalleVentaService.php

    public function query($venta)
    {
        $clientes = Cliente::toBase()->get();
       $users = User::toBase()->get();
      /*   $descripciones = Producto::toBase()->get(); */
     //dd($venta);
        $happycallestados = HappycallEstado::toBase()->get();
---
select * from `clientes`
select * from `users`
select * from `happycall_estados`

    public function getInfo($id)
    {

        return Venta::with(
            [
              /*   'cliente'  => function ($query) {
                    $query->where('id', 'nombre','apellido','identificacion');
                }, */
                'empresa' => function ($query) {
                    $query->where('id', 'nombre');
                },

            ]

        )->findOrFail($id,['id','fecha',
        'num_factura',
        'total_bruto',
        'impuesto',
        'observaciones',
        'condiciones',
        'valor_letras',
        'clausulas',
        'created_at',
        'fecha_promesa',
        'fecha_autorizado',
        'fecha_llegada',
        'fecha_entregado',
        'valor_cotizado',
        'valor_aprobado',
        'valor_cargo_cliente',
        'dinero_recibido',
        'happycallestado_id',
        'happycall_calificacion',
        'observacion_happy'
        ]);
---
select * from `empresas` where 0 = 1 and `id` = 'nombre'
select `id`, `fecha`, `num_factura`, `total_bruto`, `impuesto`, `observaciones`, `condiciones`, `valor_letras`, `clausulas`, `created_at` from `ventas` where `ventas`.`id` = '2' limit 1
select * from `clientes` where 0 = 1