app/Services/ResponseVenta.php

    public function index()
    {
        return datatables(Venta::all())
            ->editColumn('action', function ($categoria) {

                $button =  '<div class="text-lg-right text-nowrap">';
                // $button .=
                //     '<a class="btn btn-circle btn-primary mr-1" href="javascript:void(0)" onclick="editarVenta(' . $categoria->id . ')"
---
select * from `ventas`