app/Observers/DetalleObserver.php

    public function created(Detalle $detalle)
    {
        $inventario = Inventario::findOrFail($detalle->inventario_id);
        $cant = $inventario->cantidad_disponible - $detalle->cantidad;
        $inventario->cantidad_disponible = $cant < 0 ? 0 : $cant ;
        $inventario->save();
---
update `inventario` set `cantidad_disponible` = 4, `inventario`.`updated_at` = '2021-03-07 11:44:46' where `id` = 8