app/Http/Controllers/CargueInventarioController.php

select * from `inventario` where `id` = '7' limit 1
---
    public function show($id)
    {
        //


        if (request()->expectsJson()) {
            return $this->responseCargueInventario->index($id);

        }

        $inventario = Inventario::where('id',$id)->with('producto')->first();