app/Http/Controllers/VentaController.php

                    ]);
                }

                $detalles = $venta->detalles()->get();
---
select * from `detalles` where `detalles`.`venta_id` = 7 and `detalles`.`venta_id` is not null