app/Http/Controllers/VentaController.php

select `id`, `productox_id`, `serie` from `inventario` where `inventario`.`id` in (1, 7, 8)
---


         //       $detalles = $venta->detalles()->with('inventario')->with('producto')->get();
                $detalles = $venta->detalles()->with([
                   /*  'detalles' => function($query) {
                        $query->select('id', 'cantidad','precio','inventario_id'); # Muchos a muchos
                    },  */
                    'inventario' => function($query) {
                        $query->select('id', 'productox_id','serie'); # Muchos a muchos
                    },
                    'inventario.producto' => function($query) {
                        $query->select('id', 'descripcion', 'modelo' ); # Uno a muchos
                    }
                    ])->get();